tap 'caskroom/homebrew-cask' || true
brew 'rbenv'
brew 'ruby-build' 
brew 'rbenv-binstubs'
brew 'rbenv-bundle-exec'

brew 'openssl'
brew 'git'
brew 'git-flow'
brew 'vim'
brew 'tmux'
brew 'tmate'

brew 'postgresql', restart_service: true
brew 'redis', restart_service: true
cask 'caskroom/versions/java8'
brew 'elasticsearch'

brew 'go'
brew 'erlang'

brew 'imagemagick'
brew 'heroku-toolbelt'
brew 'curl'
brew 'direnv'
brew 'hivemind'
brew 'overmind'
brew 'kubernetes-cli'
brew 'deis'

brew 'node'

cask 'google-chrome'
cask 'dropbox'
cask 'slack'
cask 'keybase'
cask 'zoomus'
cask '1password'

# images optimization
cask 'imagealpha'
cask 'imageoptim'

cask 'iterm2'

cask 'docker'
cask 'flux'
cask 'torbrowser'
cask 'grammarly'
